In [89]:
import pandas as pd

Loading The data

In [90]:
# Pandas is a cool library for data analysis, manipulation and exploration. In Pandas, we generally use Dataframes and work with tabular data.
# It helps us to explore clean and process data.

# dataframe is a type of tabular format that is used to represent data in tabular form in python. In this we can give names to cols and rows/index.
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]], columns=['a', 'b', 'c'], index=['row1', 'row2', 'row3'])
df

      a  b  c
row1  1  2  3
row2  4  5  6
row3  7  8  9

In [91]:
df.head(1)
# shows us the first 5 rows of the dataframe if number not mentioned.

df.tail(2)
# shows us the last 5 rows of the dataframe if number not mentioned.

      a  b  c
row2  4  5  6
row3  7  8  9

In [92]:
df.index.to_list()
df.index
df.info()

df.nunique()
df['a'].nunique()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, row1 to row3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

3

In [93]:
df.shape

(3, 3)

In [94]:
df.describe()

         a    b    c
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [156]:
coffee = pd.read_csv('warmup_data/coffee.csv')
coffee.head()

#in read_excel(), we also pass another argument such as sheet_name, so as to only get the sheet of the excel file we want.

         Day  Coffee Type   Units Sold Monday   Espresso   25
0     Monday        Latte                  15        NaN  NaN
1    Tuesday     Espresso                  30        NaN  NaN
2    Tuesday        Latte                  20        NaN  NaN
3  Wednesday     Espresso                  35        NaN  NaN
4  Wednesday        Latte                  25        NaN  NaN

Accessing the data

In [157]:
coffee.sample(10, random_state=2)

          Day  Coffee Type   Units Sold Monday   Espresso   25
4   Wednesday        Latte                  25        NaN  NaN
0      Monday        Latte                  15        NaN  NaN
10   Saturday        Latte                  35        NaN  NaN
5    Thursday     Espresso                  40        NaN  NaN
3   Wednesday     Espresso                  35        NaN  NaN
1     Tuesday     Espresso                  30        NaN  NaN
9    Saturday     Espresso                  45        NaN  NaN
7      Friday     Espresso                  45        NaN  NaN
11     Sunday     Espresso                  45        NaN  NaN
2     Tuesday        Latte                  20        NaN  NaN

loc, iloc  -> [rows, cols]

In Pandas, loc and iloc are two fundamental functions used for selecting data from a DataFrame. They differ in how they identify the rows and columns to be selected: 

1. Label-based Indexing (. loc):
    df. loc [row_label, col_ labell]: Accesses a specific element by its row and column labels.
    df. loc [row_labels, col_labels] : Selects multiple rows and columns using lists of labels.
    df. loc [row_labell: Selects an entire row as a Series.
    df. loc:, col_labell: Selects an entire column as a Series.
    df. loc [boolean_array]: Filters rows based on a boolean condition applied to a Series or DataFrame.
2. Integer-based Indexing (• iloc):
• df. iloc[row_index, col_indexl: Accesses a specific element by its integer-based row and column positions (0-indexed).
• df. iloc[row_indices, col_indices]: Selects multiple rows and columns using lists of integer positions.
• df. iloc [row_index]: Selects an entire row by its integer position.
• df. iloci:, col_index] : Selects an entire column by its integer position.
3. Direct Element Access (• at and ,iat):
• df. at [row_label, col_label] : Efficiently accesses a single element by label, optimized for single-value retrieval.
• df. iat [row_index, col_index]: Efficiently accesses a single element by integer position, optimized for single-value retrieval.
4. Column Selection (Bracket Notation):
• df [' column_name']: Selects a single column as a Series.
• dfI['column_namel', 'column_name2']] : Selects multiple columns as a DataFrame.
5. Boolean Indexing:
• This involves creating a boolean Series or DataFrame based on a condition, then using it with. loc to filter rows. For example, df [df ['Age'] › 30] selects all rows where the 'Age' column is greater than 30.

In [97]:
coffee.loc[0]
coffee.iloc[0:10] = 10

In [98]:
coffee.head()

  Day  Coffee Type   Units Sold Monday   Espresso    25
0  10           10                  10       10.0  10.0
1  10           10                  10       10.0  10.0
2  10           10                  10       10.0  10.0
3  10           10                  10       10.0  10.0
4  10           10                  10       10.0  10.0

In [101]:
bios = pd.read_csv('warmup_data/bios.csv')

In [ ]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

Filtering Data

In [112]:
bios[(bios['height_cm'] > 215) & (bios['born_country'] =='FRA')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
82100,82753,Frédéric Weis,1977-06-22,Thionville,Moselle,FRA,France,218.0,110.0,NaN
139365,142836,Moustapha Fall,1992-02-23,Paris,Paris,FRA,France,218.0,NaN,NaN

In [122]:
bios[bios['born_country'].isin(['USA', 'FRA', 'GBR'])]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145454,149180,Anna Hoffmann,2000-03-28,Madison,Wisconsin,USA,United States,NaN,NaN,NaN
145457,149183,Alix Wilkinson,2000-08-02,Mammoth Lakes,California,USA,United States,NaN,NaN,NaN
145467,149194,Elisa Nakab,1998-05-08,Briançon,Hautes-Alpes,FRA,Italy,NaN,NaN,NaN
145468,149195,Justin Abdelkader,1987-02-25,Muskegon,Michigan,USA,United States,187.0,97.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18

In [123]:
import numpy as np

In [134]:
coffee['new price'] = np.where(coffee[' Coffee Type'] == 'Latte', 3.99, 5.59)
coffee_new = coffee

In [ ]:
coffee['new price']

0     5.59
1     5.59
2     5.59
3     5.59
4     5.59
5     5.59
6     5.59
7     5.59
8     5.59
9     5.59
10    5.59
11    5.59
12    5.59
Name: new price, dtype: float64

In [166]:
# coffee.drop(columns=['price'], inplace=True)
# coffee_new.drop(columns=['Day'])
coffee

          Day  Coffee Type   Units Sold Monday   Espresso   25
0      Monday        Latte                  15        NaN  NaN
1     Tuesday     Espresso                  30        NaN  NaN
2     Tuesday        Latte                  20        NaN  NaN
3   Wednesday     Espresso                  35        NaN  NaN
4   Wednesday        Latte                  25        NaN  NaN
5    Thursday     Espresso                  40        NaN  NaN
6    Thursday        Latte                  30        NaN  NaN
7      Friday     Espresso                  45        NaN  NaN
8      Friday        Latte                  35        NaN  NaN
9    Saturday     Espresso                  45        NaN  NaN
10   Saturday        Latte                  35        NaN  NaN
11     Sunday     Espresso                  45        NaN  NaN
12     Sunday        Latte                  35        NaN  NaN

In [172]:
# coffee = coffee[['new price', 'Coffee Type', '25']]
# coffee = coffee[['Day', 'Price']]
coffee['new_price'] = np.where(coffee[" Coffee Type"] != '1', 3.99, 5.59)

In [177]:
coffee = coffee[['Day', ' Coffee Type', ' Units Sold Monday', 'new_price']]

In [178]:
coffee

          Day  Coffee Type   Units Sold Monday  new_price
0      Monday        Latte                  15       3.99
1     Tuesday     Espresso                  30       3.99
2     Tuesday        Latte                  20       3.99
3   Wednesday     Espresso                  35       3.99
4   Wednesday        Latte                  25       3.99
5    Thursday     Espresso                  40       3.99
6    Thursday        Latte                  30       3.99
7      Friday     Espresso                  45       3.99
8      Friday        Latte                  35       3.99
9    Saturday     Espresso                  45       3.99
10   Saturday        Latte                  35       3.99
11     Sunday     Espresso                  45       3.99
12     Sunday        Latte                  35       3.99

In [179]:
coffee.rename(columns={' Coffee Type': 'Coffee Type', ' Units Sold Monday': 'Units Sold Monday'}, inplace=True)

/var/folders/h3/pfv58dg11gj_ypdwl4ypvv0r0000gn/T/ipykernel_47105/1483594378.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  coffee.rename(columns={' Coffee Type': 'Coffee Type', ' Units Sold Monday': 'Units Sold Monday'}, inplace=True)

In [181]:
coffee

          Day Coffee Type  Units Sold Monday  new_price
0      Monday       Latte                 15       3.99
1     Tuesday    Espresso                 30       3.99
2     Tuesday       Latte                 20       3.99
3   Wednesday    Espresso                 35       3.99
4   Wednesday       Latte                 25       3.99
5    Thursday    Espresso                 40       3.99
6    Thursday       Latte                 30       3.99
7      Friday    Espresso                 45       3.99
8      Friday       Latte                 35       3.99
9    Saturday    Espresso                 45       3.99
10   Saturday       Latte                 35       3.99
11     Sunday    Espresso                 45       3.99
12     Sunday       Latte                 35       3.99

In [182]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [183]:
bios_new = bios

In [184]:
bios_new.columns

Index(['athlete_id', 'name', 'born_date', 'born_city', 'born_region',
       'born_country', 'NOC', 'height_cm', 'weight_kg', 'died_date'],
      dtype='object')

In [185]:
bios_new = bios_new[['name', 'born_date', 'born_city', 'born_country', 'NOC', 'height_cm', 'weight_kg', 'died_date']]

In [186]:
bios_new

,name,born_date,born_city,born_country,NOC,height_cm,weight_kg,died_date
0,Jean-François Blanchy,1886-12-12,Bordeaux,FRA,France,NaN,NaN,1960-10-02
1,Arnaud Boetsch,1969-04-01,Meulan,FRA,France,183.0,76.0,NaN
2,Jean Borotra,1898-08-13,Biarritz,FRA,France,183.0,76.0,1994-07-17
3,Jacques Brugnon,1895-05-11,Paris VIIIe,FRA,France,168.0,64.0,1978-03-20
4,Albert Canet,1878-04-17,Wandsworth,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...
145495,Polina Luchnikova,2002-01-30,Serov,RUS,ROC,167.0,61.0,NaN
145496,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),RUS,ROC,168.0,65.0,NaN
145497,Yuliya Smirnova,1998-05-08,Kotlas,RUS,ROC,163.0,55.0,NaN
145498,André Foussard,1899-05-19,Niort,FRA,France,166.0,NaN,1986-03-18
145499,Bill Phillips,1913-07-15,Dulwich Hill,AUS,Australia,NaN,NaN,2003-10-20

In [195]:
bios_new['first_name'] = bios_new['name'].str.split(" ").str[0]

/var/folders/h3/pfv58dg11gj_ypdwl4ypvv0r0000gn/T/ipykernel_47105/1294443424.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bios_new['first_name'] = bios_new['name'].str.split(" ").str[0]

In [200]:
bios_new.query('first_name == "Kobe"')

,name,born_date,born_city,born_country,NOC,height_cm,weight_kg,died_date,first_name
112365,Kobe Bryant,1978-08-23,Philadelphia,USA,United States,198.0,100.0,2020-01-26,Kobe

In [201]:
bios_new.info(
    
)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   name          145500 non-null  object
 1   born_date     143693 non-null  object
 2   born_city     110908 non-null  object
 3   born_country  110908 non-null  object
 4   NOC           145499 non-null  object
 5   height_cm     106651 non-null  float64
 6   weight_kg     102070 non-null  float64
 7   died_date     33940 non-null   object
 8   first_name    145500 non-null  object
dtypes: float64(2), object(7)
memory usage: 10.0+ MB

In [202]:
bios_new.head()

,name,born_date,born_city,born_country,NOC,height_cm,weight_kg,died_date,first_name
0,Jean-François Blanchy,1886-12-12,Bordeaux,FRA,France,NaN,NaN,1960-10-02,Jean-François
1,Arnaud Boetsch,1969-04-01,Meulan,FRA,France,183.0,76.0,NaN,Arnaud
2,Jean Borotra,1898-08-13,Biarritz,FRA,France,183.0,76.0,1994-07-17,Jean
3,Jacques Brugnon,1895-05-11,Paris VIIIe,FRA,France,168.0,64.0,1978-03-20,Jacques
4,Albert Canet,1878-04-17,Wandsworth,GBR,France,NaN,NaN,1930-07-25,Albert

In [207]:
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'], format="%Y-%m-%d")

In [209]:
bios_new.drop(columns='born datetime')

,name,born_date,born_city,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_datetime
0,Jean-François Blanchy,1886-12-12,Bordeaux,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886-12-12
1,Arnaud Boetsch,1969-04-01,Meulan,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01
2,Jean Borotra,1898-08-13,Biarritz,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13
3,Jacques Brugnon,1895-05-11,Paris VIIIe,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11
4,Albert Canet,1878-04-17,Wandsworth,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17
...,...,...,...,...,...,...,...,...,...,...
145495,Polina Luchnikova,2002-01-30,Serov,RUS,ROC,167.0,61.0,NaN,Polina,2002-01-30
145496,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),RUS,ROC,168.0,65.0,NaN,Valeriya,1999-09-20
145497,Yuliya Smirnova,1998-05-08,Kotlas,RUS,ROC,163.0,55.0,NaN,Yuliya,1998-05-08
145498,André Foussard,1899-05-19,Niort,FRA,France,166.0,NaN,1986-03-18,André,1899-05-19
145499,Bill Phillips,1913-07-15,Dulwich Hill,AUS,Australia,NaN,NaN,2003-10-20,Bill,1913-07-15

In [218]:
bios.to_csv('./warmup_data/bios_new.csv', index= False)

In [211]:
bios['Height category'] = bios['height_cm'].apply(lambda x: 'Short' if x < 175 else('Average' if x < 190 else 'Tall'))

In [215]:
# else we could have done 
def height_func(row):
    if row['height_cm'] < 175 and row['weight_kg']:
        return 'Lightweight'
    elif row['height_cm'] < 190 and row['weight_kg']:
        return 'Middleweight'
    else:
        return 'Heavyweight'
# axis=1  is for rows, for columns is for 0
bios["BMI Category"] = bios.apply(height_func, axis=1)

In [216]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,Height category,BMI Category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Short,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall,Heavyweight